perf/clean.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node-replicated:
      target: 'http://localhost:5555/node-replicated/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50

  phases:
    - name: clean
      duration: 120
      arrivalRate: 0 # requests per second


scenarios:
  - name: Ping (/ping)
    flow:
      - get:
          url: '/ping/'