perf/ping.yaml
config:
  environments:
    node-replicated:
      target: 'http://localhost:5555/node-replicated/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 1000 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 0
      rampTo: 150
    - name: Plain
      duration: 40
      arrivalRate: 30
    - name: NoOp_1
      arrivalRate: 0
      duration: 20
    - name: Burst_1
      arrivalRate: 100
      duration: 5
    - name: NoOp_2
      arrivalRate: 0
      duration: 15
    - name: Burst_2
      arrivalRate: 30
      duration: 10
    - name: NoOp_3
      arrivalRate: 0
      duration: 10
    

scenarios:
  - name: Ping (/ping)
    flow:
      - get:
          url: '/ping'