perf/timeout.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node-replicated:
      target: 'http://localhost:5555/node-replicated/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50

  phases:
    - name: Ramp
      duration: 45
      arrivalRate: 5 # requests per second
      rampTo: 30
    - name: Ramp_2
      duration: 45
      arrivalRate: 30 # requests per second
      rampTo: 60
    - name: Ramp_3
      duration: 45
      arrivalRate: 60 # requests per second
      rampTo: 90

scenarios:
  - name: Timeout (/timeout)
    flow:
      - get:
          url: '/timeout/'